---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartDepthInOption
source: html/e3d2627f-8e51-e892-e6d1-0d2e26f826f3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartDepthInOption Property

"Main Primary Depth Option"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartDepthInOption { get; }
```